interface MajorMapItem {
  label: string;
  minor: Record<number, string>;
}

export const majorMap: Record<number, MajorMapItem> = {
  3: {
    label: '操作',
    minor: {
      1024: '远程开门',
      1025: '远程关门',
      1026: '远程常开',
      1027: '远程常关',
    },
  },
  5: {
    label: '事件',
    minor: {
      1: '卡认证失败',
      2: '卡认证成功',
      7: '无效通行时段',
      8: '通行权限到期',
      9: '无此卡号',
      21: '门打开',
      22: '门关闭',
      23: '开门按钮按下',
      24: '开门按钮放开',
      25: '门磁打开',
      26: '门磁关闭',
      27: '门磁异常打开',
      28: '门磁打开超时、门磁未关超时',
      75: '人脸认证成功',
      76: '人脸认证失败',
      150: '密码认证失败',
      156: '二维码认证成功',
      157: '二维码认证失败',
      179: '动态验证码认证成功',
      180: '动态验证码认证失败',
      181: '密码认证成功',
    },
  },
};

export const minorSuccessList = [2, 75, 156, 179, 181];
export const minorFailList = [1, 7, 8, 9, 27, 76, 150, 157, 180];
